doag_2019/utilities/Skripte_190307/12_Tool_Sonstige/jmeter/Sakila DB Load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Sakila DB" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="Cannot load JDBC driver class &apos;com.mysql.jdbc.Driver&apos;" elementType="Argument">
            <stringProp name="Argument.name">Cannot load JDBC driver class &apos;com.mysql.jdbc.Driver&apos;</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">/Users/ras/Downloads/mysql-connector-java-8.0.15/mysql-connector-java-8.0.15.jar</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JDBC Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="ACTOR" enabled="true">
          <stringProp name="dataSource">sakiladb</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from sakila.actor;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="FILM" enabled="true">
          <stringProp name="dataSource">sakiladb</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">select * from sakila.film;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="ADD RENTAL" enabled="true">
          <stringProp name="dataSource">sakiladb</stringProp>
          <stringProp name="queryType">Update Statement</stringProp>
          <stringProp name="query">insert into sakila.rental
(rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update)
values
(null,
curdate(),
(select inventory_id from inventory  order by rand() limit 1),
(select customer_id from customer  order by rand() limit 1), 
curdate() + interval 7 day,
(select staff_id from staff order by rand() limit 1),
now()
)</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="SakilaDB" enabled="true">
          <stringProp name="dataSource">sakiladb</stringProp>
          <stringProp name="poolMax">50</stringProp>
          <stringProp name="timeout">1000</stringProp>
          <stringProp name="trimInterval">5000</stringProp>
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://localhost:3306/sakila</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <stringProp name="username">root</stringProp>
          <stringProp name="password">Ordix0590</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>